JorgeArturo/Tutoriales_LPC54114/Tutorial_11/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief MCLK direction control.: The MCLK function is an output. */
#define MCLKIO_DIR_OUTPUT 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO010_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO025_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO026_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO030_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO08_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO08_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO09_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO09_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO10_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO112_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO112_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO113_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO113_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO114_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO114_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO116_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO116_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO12_FUNC_ALT1 0x01u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO12_MODE_INACTIVE 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO14_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO14_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO18_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO18_FUNC_ALT0 0x00u

/*! @name PIO0_30 (number 12), J9[2]/P0_30-ADC1
  @{ */
#define BOARD_VSYNC_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_VSYNC_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_VSYNC_PIN 30U   /*!<@brief 0U pin index: 30 */
                              /* @} */

/*! @name PIO1_8 (number 28), J1[12]/J9[6]/P1_8-ADC11-FC7_TXD_SCL_MISO_FRAME
  @{ */
#define BOARD_HREF_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_HREF_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_HREF_PIN 8U    /*!<@brief 1U pin index: 8 */
                             /* @} */

/*! @name PIO1_4 (number 18), J2[18]/J9[10]/P1_4-ADC7-PDM1_CLK-FC7_RTS-FC3_TXD
  @{ */
#define BOARD_PCLK_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_PCLK_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_PCLK_PIN 4U    /*!<@brief 1U pin index: 4 */
                             /* @} */

/*! @name PIO0_8 (number 43), J2[15]/P0_8-FC2_RXD_SDA_MOSI
  @{ */
#define BOARD_D0_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_D0_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_D0_PIN 8U    /*!<@brief 0U pin index: 8 */
                           /* @} */

/*! @name PIO0_9 (number 44), J2[13]/P0_9-FC2_TXD_SCL_MISO
  @{ */
#define BOARD_D1_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_D1_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_D1_PIN 9U    /*!<@brief 0U pin index: 9 */
                           /* @} */

/*! @name PIO0_10 (number 45), J2[11]/P0_10-FC2_SCK-CT32B3_MAT0
  @{ */
#define BOARD_D2_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_D2_PORT 0U   /*!<@brief PORT device name: 0U */
#define BOARD_D2_PIN 10U   /*!<@brief 0U pin index: 10 */
                           /* @} */

/*! @name PIO1_12 (number 51), J2[9]/P1_12-CT32B1_MAT0-ACCl_INT1
  @{ */
#define BOARD_D3_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_D3_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_D3_PIN 12U   /*!<@brief 1U pin index: 12 */
                           /* @} */

/*! @name PIO1_13 (number 54), J2[7]/P1_13-CT32B1_MAT1
  @{ */
#define BOARD_D4_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_D4_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_D4_PIN 13U   /*!<@brief 1U pin index: 13 */
                           /* @} */

